BGCX067/fakit-with-load-nfc-v2-svn-to-git/trunk/FA_5510_USB/TI_DriverLib/MSP430FR5xx_6xx/comp_e.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2012, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
//*****************************************************************************
//
//compe.c - Driver for the COMPARATOR_E Module.
//
//*****************************************************************************
#include "inc/hw_regaccess.h"
#include "comp_e.h"
#ifdef  __IAR_SYSTEMS_ICC__
#include "deprecated/IAR/msp430xgeneric.h"
#else
#include "deprecated/CCS/msp430xgeneric.h"
#endif
#include "assert.h"

//*****************************************************************************
//
//! Initializes the Comparator Module.
//!
//! \param baseAddress is the base address of the Comparator module.
//! \param positiveTerminalInput selects the input to the positive terminal.
//!        Valid values are
//!        \b COMP_E_INPUT0 [Default]
//!        \b COMP_E_INPUT1
//!        \b COMP_E_INPUT2
//!        \b COMP_E_INPUT3
//!        \b COMP_E_INPUT4
//!        \b COMP_E_INPUT5
//!        \b COMP_E_INPUT6
//!        \b COMP_E_INPUT7
//!        \b COMP_E_INPUT8
//!        \b COMP_E_INPUT9
//!        \b COMP_E_INPUT10
//!        \b COMP_E_INPUT11
//!        \b COMP_E_INPUT12
//!        \b COMP_E_INPUT13
//!        \b COMP_E_INPUT14
//!        \b COMP_E_INPUT15
//!        \b COMP_E_VREF
//!        Modified bits are \b CEIPSEL and \b CEIPEN of \b CECTL0 register,
//!        \b CERSEL of \b CECTL2 register, and CEPDx of \b CECTL3 register.
//! \param negativeTerminalInput selects the input to the negative terminal.
//!        Valid values are
//!        \b COMP_E_INPUT0 [Default]
//!        \b COMP_E_INPUT1
//!        \b COMP_E_INPUT2
//!        \b COMP_E_INPUT3
//!        \b COMP_E_INPUT4
//!        \b COMP_E_INPUT5
//!        \b COMP_E_INPUT6
//!        \b COMP_E_INPUT7
//!        \b COMP_E_INPUT8
//!        \b COMP_E_INPUT9
//!        \b COMP_E_INPUT10
//!        \b COMP_E_INPUT11
//!        \b COMP_E_INPUT12
//!        \b COMP_E_INPUT13
//!        \b COMP_E_INPUT14
//!        \b COMP_E_INPUT15
//!        \b COMP_E_VREF
//!        Modified bits are \b CEIMSEL and \b CEIMEN of \b CECTL0 register,
//!        \b CERSEL of \b CECTL2 register, and CEPDx of \b CECTL3 register.
//! \param outputFilterEnableAndDelayLevel controls the output filter delay
//!       state, which is either off or enabled with a specified delay level.
//!        Valid values are
//!        \b COMP_E_FILTEROUTPUT_OFF [Default]
//!        \b COMP_E_FILTEROUTPUT_DLYLVL1
//!        \b COMP_E_FILTEROUTPUT_DLYLVL2
//!        \b COMP_E_FILTEROUTPUT_DLYLVL3
//!        \b COMP_E_FILTEROUTPUT_DLYLVL4
//!        This parameter is device specific and delay levels should be found in
//!        the device's datasheet.
//!        Modified bits are \b CEF and \b CEFDLY of \b CECTL1 register.
//! \param invertedOutput controls if the output will be inverted or not
//!        Valid values are
//!        \b COMP_E_NORMALOUTPUTPOLARITY - indicates the output should be normal.
//!             [Default]
//!        \b COMP_E_INVERTEDOUTPUTPOLARITY -  the output should be inverted.
//!        Modified bits are \b CEOUTPOL of \b CECTL1 register.
//!
//! Upon successful initialization of the Comparator module, this function will
//! have reset all necessary register bits and set the given options in the
//! registers. To actually use the comparator module, the COMP_E_enable()
//! function must be explicitly called before use.
//! If a Reference Voltage is set to a terminal, the Voltage should be set
//! using the setReferenceVoltage() function.
//!
//! \return STATUS_SUCCESS or STATUS_FAILURE of the initialization process.
//
//*****************************************************************************
unsigned short COMP_E_init (uint32_t baseAddress,
    uint8_t positiveTerminalInput,
    uint8_t negativeTerminalInput,
    uint8_t outputFilterEnableAndDelayLevel,
    unsigned short invertedOutputPolarity)
{
    assert(positiveTerminalInput <= COMP_E_VREF);
    assert(negativeTerminalInput <= COMP_E_VREF);
    assert(positiveTerminalInput != negativeTerminalInput);
    assert(outputFilterEnableAndDelayLevel <= COMP_E_FILTEROUTPUT_DLYLVL4);

    uint8_t retVal = STATUS_SUCCESS;

    //Reset COMPE Control 1 & Interrupt Registers for initialization (OFS_CECTL3
    //is not reset because it controls the input buffers of the analog signals
    //and may cause parasitic effects if an analog signal is still attached and
    //the buffer is re-enabled
    HWREG16(baseAddress + OFS_CECTL0) &= 0x0000;
    HWREG16(baseAddress + OFS_CEINT)  &= 0x0000;

